//
//  Tips.swift
//  MC2-Team7-Fighring
//
//  Created by Ko Seokjun on 2023/05/14.
//

import Foundation

struct Tips {
    static var tip = [
        "위의 답변을 바탕으로 연인의 생각을 들어보는 시간을 갖는 건 어떨까요?\n서로를 더욱 이해할 수 있는 계기가 될 거에요!",
        "같이 즐길 수 있는 취미를 만들어보는 건 어떨까요? 서로에게 집중하고 있는 여러분을 발견할 수 있을거에요!",
        "연인을 만날 때면 한번은 꼭 가볍게 안아주세요. 행복한 감정은 배가 되고, 슬픈 감정은 녹아내린답니다.",
        "여러분의 이야기에 귀를 기울일 수 있는 가장 가까운 사람은 연인입니다. 고민이 있다면 주저말고 말해보세요. 어쩌면 마음이 가벼워질 수도 …!",
        "연인의 수많은 장점 중 내가 좋아하는 세 가지만 공유해보세요. 항상 곁에 있다고 소중하지 않은 건 아니랍니다!😜",
        "어느새 서로에 대한 전문가가 되었군요! 서로를 누구보다 잘 아는 여러분이기에 배려하는 마음을 갖고 행동한다면 어떤 어려움도 헤쳐나갈 수 있을 거에요."
    ]
}
